In [1]:
! pip install mysql-connector-python==9.1.0

Collecting mysql-connector-python==9.1.0
  Downloading mysql_connector_python-9.1.0-cp313-cp313-win_amd64.whl.metadata (6.2 kB)
Downloading mysql_connector_python-9.1.0-cp313-cp313-win_amd64.whl (16.1 MB)
   ---------------------------------------- 0.0/16.1 MB ? eta -:--:--
   -- ------------------------------------- 1.0/16.1 MB 30.2 MB/s eta 0:00:01
   ----- ---------------------------------- 2.1/16.1 MB 6.3 MB/s eta 0:00:03
   ------- -------------------------------- 3.1/16.1 MB 6.2 MB/s eta 0:00:03
   ------------- -------------------------- 5.2/16.1 MB 6.6 MB/s eta 0:00:02
   --------------- ------------------------ 6.3/16.1 MB 6.2 MB/s eta 0:00:02
   ------------------ --------------------- 7.3/16.1 MB 6.0 MB/s eta 0:00:02
   -------------------- ------------------- 8.4/16.1 MB 6.0 MB/s eta 0:00:02
   ----------------------- ---------------- 9.4/16.1 MB 5.9 MB/s eta 0:00:02
   -------------------------- ------------- 10.5/16.1 MB 6.1 MB/s eta 0:00:01
   ------------------------------- -------- 12.6/16.1 MB 6.1 MB/s eta 0:00:01
   --------------------------------- ------ 13.6/16.1 MB 6.1 MB/s eta 0:00:01
   --------------------------------- ------ 13.6/16.1 MB 6.1 MB/s eta 0:00:01
   --------------------------------- ------ 13.6/16.1 MB 6.1 MB/s eta 0:00:01
   ----------------------------------- ---- 14.2/16.1 MB 4.8 MB/s eta 0:00:01
   ---------------------------------------  15.7/16.1 MB 5.1 MB/s eta 0:00:01
   ---------------------------------------- 16.1/16.1 MB 4.9 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.1.0

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
! pip install SQLAlchemy==2.0.36

Collecting SQLAlchemy==2.0.36
  Downloading SQLAlchemy-2.0.36-cp313-cp313-win_amd64.whl.metadata (9.9 kB)
Collecting typing-extensions>=4.6.0 (from SQLAlchemy==2.0.36)
  Using cached typing_extensions-4.15.0-py3-none-any.whl.metadata (3.3 kB)
Downloading SQLAlchemy-2.0.36-cp313-cp313-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 21.6 MB/s eta 0:00:00
Using cached typing_extensions-4.15.0-py3-none-any.whl (44 kB)
Installing collected packages: typing-extensions, SQLAlchemy
Successfully installed SQLAlchemy-2.0.36 typing-extensions-4.15.0

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import sqlalchemy as db
import pandas as pd

In [ ]:
# 1. Crea el objeto 'engine' que define la configuraci칩n de la conexi칩n.
# Usa el driver 'mysqlconnector' para conectarse al usuario 'root' con contrase침a 'root'
# en el servidor local (localhost), puerto 3310 y apunta a la base de datos 'retail_db'.
engine = db.create_engine('mysql+mysqlconnector://root:root@localhost:3310/retail_db')

# 2. Establece y abre formalmente la conexi칩n activa con la base de datos.
# Este objeto 'conn' es el que se utiliza para ejecutar consultas (queries) SQL.
conn = engine.connect()

In [ ]:
# Extraer Datos de TODA LA TABLA
df_departments = pd.read_sql_table('departments', con=conn)
df_departments

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop

In [ ]:
# Extraer Datos de mediante una query
df_departments = pd.read_sql_query("SELECT * FROM departments LIMIT 3", con=conn)
df_departments

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel

In [12]:
# Extraer Datos de mediante una query
df_departments = pd.read_sql("SELECT * FROM departments LIMIT 3", con=conn)
df_departments

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel